# Table of Contents
 <p><div class="lev1 toc-item"><a href="#Concatenate-row-wise" data-toc-modified-id="Concatenate-row-wise-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Concatenate row-wise</a></div><div class="lev1 toc-item"><a href="#Concatenate-column-wise" data-toc-modified-id="Concatenate-column-wise-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Concatenate column-wise</a></div><div class="lev1 toc-item"><a href="#Merging" data-toc-modified-id="Merging-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Merging</a></div><div class="lev2 toc-item"><a href="#One-to-one-merge" data-toc-modified-id="One-to-one-merge-31"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>One to one merge</a></div><div class="lev2 toc-item"><a href="#Many-to-one-merge" data-toc-modified-id="Many-to-one-merge-32"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Many to one merge</a></div><div class="lev2 toc-item"><a href="#Many-to-many-merge" data-toc-modified-id="Many-to-many-merge-33"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>Many to many merge</a></div><div class="lev1 toc-item"><a href="#Assert-statements" data-toc-modified-id="Assert-statements-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Assert statements</a></div>

Now that we have a general sense of working with data,
we will now move on to combining multiple datasets.
We can concatenate data together, or merge them based on values within column(s).

When we have a single dataset that is broken up into parts, we can **concatenate** them together.
If we have different datasets that we want to combine, we **merge** them together.

In [1]:
# first load up the example datasets for concatenation
import pandas as pd

In [2]:
df1 = pd.read_csv('../data/concat_1.csv')

In [3]:
df2 = pd.read_csv('../data/concat_2.csv')

In [4]:
df3 = pd.read_csv('../data/concat_3.csv')

In [5]:
df1

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [6]:
df2

    A   B   C   D
0  a4  b4  c4  d4
1  a5  b5  c5  d5
2  a6  b6  c6  d6
3  a7  b7  c7  d7

In [7]:
df3

     A    B    C    D
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

# Concatenate row-wise

In [8]:
# concatenate row-wise
row_concat = pd.concat([df1, df2, df3])

In [9]:
row_concat

     A    B    C    D
0   a0   b0   c0   d0
1   a1   b1   c1   d1
2   a2   b2   c2   d2
3   a3   b3   c3   d3
0   a4   b4   c4   d4
1   a5   b5   c5   d5
2   a6   b6   c6   d6
3   a7   b7   c7   d7
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [10]:
# getting the first row after concatenation
row_concat.iloc[0]

A    a0
B    b0
C    c0
D    d0
Name: 0, dtype: object

In [11]:
# getting the rows with label 0 after concatenation
row_concat.loc[0]

    A   B   C   D
0  a0  b0  c0  d0
0  a4  b4  c4  d4
0  a8  b8  c8  d8

# Concatenate column-wise

In [12]:
# ignore_index will reset the row and column labelings
# concatenating columns
col_concat = pd.concat([df1, df2, df3], axis=1, ignore_index=True)
col_concat

   0   1   2   3   4   5   6   7    8    9    10   11
0  a0  b0  c0  d0  a4  b4  c4  d4   a8   b8   c8   d8
1  a1  b1  c1  d1  a5  b5  c5  d5   a9   b9   c9   d9
2  a2  b2  c2  d2  a6  b6  c6  d6  a10  b10  c10  d10
3  a3  b3  c3  d3  a7  b7  c7  d7  a11  b11  c11  d11

In [13]:
list(range(len(col_concat.columns)))

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]

In [14]:
# concatenate without resetting the index
col_concat = pd.concat([df1, df2, df3], axis=1)
col_concat

    A   B   C   D   A   B   C   D    A    B    C    D
0  a0  b0  c0  d0  a4  b4  c4  d4   a8   b8   c8   d8
1  a1  b1  c1  d1  a5  b5  c5  d5   a9   b9   c9   d9
2  a2  b2  c2  d2  a6  b6  c6  d6  a10  b10  c10  d10
3  a3  b3  c3  d3  a7  b7  c7  d7  a11  b11  c11  d11

In [15]:
col_concat.columns == 'C'

array([False, False,  True, False, False, False,  True, False, False,
       False,  True, False], dtype=bool)

In [16]:
# rename columns to show what happens when things don't align
df1.columns = ['A', 'B', 'C', 'D']
df2.columns = ['E', 'F', 'G', 'H']
df3.columns = ['A', 'C', 'F', 'H']

In [17]:
# run the same thing as before, with the new colum names
pd.concat([df1, df2, df3])

     A    B    C    D    E    F    G    H
0   a0   b0   c0   d0  NaN  NaN  NaN  NaN
1   a1   b1   c1   d1  NaN  NaN  NaN  NaN
2   a2   b2   c2   d2  NaN  NaN  NaN  NaN
3   a3   b3   c3   d3  NaN  NaN  NaN  NaN
0  NaN  NaN  NaN  NaN   a4   b4   c4   d4
1  NaN  NaN  NaN  NaN   a5   b5   c5   d5
2  NaN  NaN  NaN  NaN   a6   b6   c6   d6
3  NaN  NaN  NaN  NaN   a7   b7   c7   d7
0   a8  NaN   b8  NaN  NaN   c8  NaN   d8
1   a9  NaN   b9  NaN  NaN   c9  NaN   d9
2  a10  NaN  b10  NaN  NaN  c10  NaN  d10
3  a11  NaN  b11  NaN  NaN  c11  NaN  d11

# Merging

In [18]:
# load data to perform merging
person = pd.read_csv('../data/survey_person.csv')
site = pd.read_csv('../data/survey_site.csv')
survey = pd.read_csv('../data/survey_survey.csv')
visited = pd.read_csv('../data/survey_visited.csv')

In [19]:
person

      ident   personal    family
0      dyer    William      Dyer
1        pb      Frank   Pabodie
2      lake   Anderson      Lake
3       roe  Valentina   Roerich
4  danforth      Frank  Danforth

In [20]:
site

    name    lat    long
0   DR-1 -49.85 -128.57
1   DR-3 -47.15 -126.72
2  MSK-4 -48.87 -123.40

In [21]:
survey

    taken person quant  reading
0     619   dyer   rad     9.82
1     619   dyer   sal     0.13
2     622   dyer   rad     7.80
3     622   dyer   sal     0.09
4     734     pb   rad     8.41
5     734   lake   sal     0.05
6     734     pb  temp   -21.50
7     735     pb   rad     7.22
8     735    NaN   sal     0.06
9     735    NaN  temp   -26.00
10    751     pb   rad     4.35
11    751     pb  temp   -18.50
12    751   lake   sal     0.10
13    752   lake   rad     2.19
14    752   lake   sal     0.09
15    752   lake  temp   -16.00
16    752    roe   sal    41.60
17    837   lake   rad     1.46
18    837   lake   sal     0.21
19    837    roe   sal    22.50
20    844    roe   rad    11.25

In [22]:
visited

   ident   site       dated
0    619   DR-1  1927-02-08
1    622   DR-1  1927-02-10
2    734   DR-3  1939-01-07
3    735   DR-3  1930-01-12
4    751   DR-3  1930-02-26
5    752   DR-3         NaN
6    837  MSK-4  1932-01-14
7    844   DR-1  1932-03-22

In [23]:
# use the question mark to get a popup of the documentation
pd.merge?

In [24]:
site.merge?

In [25]:
# subset the visited dataframe for the first example
visited_subset = visited.iloc[[0, 2, 6]]

In [26]:
visited_subset

   ident   site       dated
0    619   DR-1  1927-02-08
2    734   DR-3  1939-01-07
6    837  MSK-4  1932-01-14

## One to one merge

In [27]:
# one-to-one merge
o2o = pd.merge(site, visited_subset, left_on='name', right_on='site')

In [28]:
o2o

    name    lat    long  ident   site       dated
0   DR-1 -49.85 -128.57    619   DR-1  1927-02-08
1   DR-3 -47.15 -126.72    734   DR-3  1939-01-07
2  MSK-4 -48.87 -123.40    837  MSK-4  1932-01-14

## Many to one merge

In [29]:
# many to one
# m2o / o2m
# site - visited
m2o = site.merge(visited, left_on=['name'], right_on=['site'],)
m2o

    name    lat    long  ident   site       dated
0   DR-1 -49.85 -128.57    619   DR-1  1927-02-08
1   DR-1 -49.85 -128.57    622   DR-1  1927-02-10
2   DR-1 -49.85 -128.57    844   DR-1  1932-03-22
3   DR-3 -47.15 -126.72    734   DR-3  1939-01-07
4   DR-3 -47.15 -126.72    735   DR-3  1930-01-12
5   DR-3 -47.15 -126.72    751   DR-3  1930-02-26
6   DR-3 -47.15 -126.72    752   DR-3         NaN
7  MSK-4 -48.87 -123.40    837  MSK-4  1932-01-14

In [30]:
# prepare example for many to many merge
df1 = pd.DataFrame({
    'a': [1, 1, 1, 2, 2],
    'b': [10, 20, 30, 40, 50]
})

df2 = pd.DataFrame({
    'a1': [1, 1, 2, 2, 3],
    'b2': [100, 200, 300, 400, 500]
})

In [31]:
df1

   a   b
0  1  10
1  1  20
2  1  30
3  2  40
4  2  50

In [32]:
df2

   a1   b2
0   1  100
1   1  200
2   2  300
3   2  400
4   3  500

## Many to many merge

In [33]:
# perform the many to one merge
m2m = df1.merge(df2, left_on='a', right_on='a1')

In [34]:
df1.shape

(5, 2)

In [35]:
df2.shape

(5, 2)

In [36]:
# not that after the merge we have more rows than what we started
m2m.shape

(10, 4)

In [37]:
# we get a cartesian product
m2m

   a   b  a1   b2
0  1  10   1  100
1  1  10   1  200
2  1  20   1  100
3  1  20   1  200
4  1  30   1  100
5  1  30   1  200
6  2  40   2  300
7  2  40   2  400
8  2  50   2  300
9  2  50   2  400

# Assert statements

In [38]:
# write assert statements to check your assumptions as you code
assert df1.shape == df2.shape

In [39]:
m2m.shape[0]

10

In [40]:
# if something does not equate to True
# the assert will fail
assert m2m.shape[0] == df1.shape[0]

AssertionError: